index.html
---
layout: page
title: Computer Science Wiki
---

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Hinweis</h2>
<div class="outline-text-2" id="text-1">
<p>
I'm currently migrating this wiki from Markdown to Emacs Org Mode. The
old sources can be found here
<a href="https://bitbucket.org/alphaAndOmega/inf_wiki">https://bitbucket.org/alphaAndOmega/inf_wiki</a>
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Inhalt</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li><a href="./digisys/index.html">Digitale Systeme</a>
</li>
<li><a href="./os/index.html">Betriebssysteme</a>
</li>
<li><a href="./swt/index.html">Softwaretechnik</a>
</li>
<li><a href="./mathe/index.html">Mathe</a>
</li>
<li><a href="./oop/index.html">Objektorientierte Programmierung</a>
</li>
<li><a href="./ads/index.html">Algorithmen und Datenstrukturen</a>
</li>
<li><a href="./oar/index.html">Organisation und Architektur von Rechnern</a>
</li>
<li><a href="./tgi/index.html">Theoretische Grundlagen der Informatik</a>
</li>
<li><a href="./logik/index.html">Logik</a>
</li>
<li><a href="./nvp/index.html">Nebenläufige und Verteilte Prgrammierung</a>
</li>
<li><a href="./comsys/index.html">Kommunikationssysteme</a>
</li>
<li>Programmiersprachen
<ul class="org-ul">
<li><a href="./lang/c.html">C</a>
</li>
<li><a href="./lang/java.html">Java</a>
</li>
<li><a href="./lang/haskell.html">Haskell</a>
</li>
<li><a href="./lang/prolog.html">Prolog</a>
</li>
<li><a href="./lang/erlang.html">Erlang</a>
</li>
</ul>
</li>
</ul>
</div>
</div>
